[
  {
    "path": "posts/2021-07-16-third-time-a-charm/",
    "title": "MC 2 - Viz Assignment",
    "description": "Using visualisation techniques in R to investigate the disappearance of employees at GAStech",
    "author": [
      {
        "name": "Manmit",
        "url": {}
      }
    ],
    "date": "2021-07-16",
    "categories": [],
    "contents": "\r\n1.Overview\r\nThis assignment is part of VAST Challenge 2021 – Mini Challenge-2 (“MC-2”).\r\nThe challenge scenario is given as follows:\r\n“In January, 2014, the leaders of GAStech are celebrating their new-found fortune as a result of the initial public offering of their very successful company. In the midst of this celebration, several employees of GAStech go missing. An organization known as the Protectors of Kronos (POK) is suspected in the disappearance, but things may not be what they seem.”\r\nAs part of Mini-Challenge 2, visual analytics is performed on i) employee movement; ii) vehicle tracking; and iii) credit card transactions and loyalty card usage data . From this, visual analysis is performed to identify anomalies and suspicious behaviours. This will be used by the law-enforcement agents to get to the bottom of the case. The visual analysis aims to provide answers to the following questions posed by MC-2: -\r\nIdentify the most popular locations, and when they are popular. What anomalies do you see? What corrections would you recommend to correct these anomalies?\r\nWhat discrepancies between vehicle, credit, and loyalty card data do you find?\r\nCan you infer the owners of each credit card and loyalty card? What is your evidence? Where are there uncertainties in your method? Given the data sources provided, identify potential informal or unofficial relationships among GASTech personnel.\r\nDo you see evidence of suspicious activity? Identify 1- 10 locations where you believe the suspicious activity is occurring, and why.\r\n\r\n\r\n#Installing and Launching R Packages\r\n\r\npackages = c('igraph','visNetwork','lubridate', 'DT', 'ggiraph', 'plotly', 'tidyverse', 'raster', 'sf', 'tmap', 'clock', 'rgdal','dplyr','sugrrants', 'hms', 'esquisse','Radviz', 'crosstalk','timetk', 'tidygraph', 'ggraph', 'ggrepel', 'psych', 'htmltools')\r\nlibrary(ggplot2)\r\n\r\n\r\nfor (p in packages){\r\nif (!require(p, character.only = T)){\r\n  install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n\r\n\r\n#Importing car-assignment data\r\ncar_assign<- read_csv(\"data/car-assignments.csv\")\r\ncredit_card<- read_csv(\"data/cc_data.csv\")\r\ngps <- read_csv(\"data/gps.csv\")\r\nloyalty <- read_csv(\"data/loyalty_data.csv\")\r\ncombined_trans <-read_csv(\"data/All_Combined2.csv\")\r\ncombined_trans_pivot <- read_csv(\"data/All_Combined3.csv\")\r\n\r\n\r\n\r\n\r\n\r\n#Clean Data\r\n\r\n#For Car_Assign, Truck Drivers have no Car Id. Change 'NA' to '0' and CarID used as_factor\r\ncar_assign[is.na(car_assign)] = 0\r\ncar_assign$CarID <- as_factor(car_assign$CarID)\r\ncar_assign_clean <- car_assign\r\n\r\n\r\n#Credit Card Timestamp data needs to be in the proper attribute\r\ncredit_card$timestamp <- date_time_parse(credit_card$timestamp,\r\n                                 zone = \"\",\r\n                                 format = \"%m/%d/%Y %H:%M\")\r\n\r\ncredit_card$last4ccnum <- as_factor(credit_card$last4ccnum)\r\n#credit_card$location <- as_factor(credit_card$location)\r\ncredit_card_clean <- credit_card\r\n\r\n#GPS Timestamp needs to be in the proper attribute use clock for gps, can separate by different day.see the get_minute and the other clock code chunks\r\ngps$Timestamp <- date_time_parse(gps$Timestamp,\r\n                                 zone = \"\",\r\n                                 format = \"%m/%d/%Y %H:%M:%S\")\r\ngps$id <- as_factor(gps$id)\r\ngps_clean <- gps\r\n\r\n#Loyalty Card Data, timestamp needs to be in the proper attribute and  loyalty number as factor\r\nloyalty$timestamp <- date_parse(loyalty$timestamp,\r\n                                format = \"%m/%d/%Y\")\r\nloyalty$loyaltynum <- as_factor(loyalty$loyaltynum)\r\n#loyalty$location <- as_factor(loyalty$location)\r\n\r\nloyalty_clean <- loyalty\r\n\r\n\r\n\r\n\r\ncombined_trans$LoyaltyDate <- date_parse(combined_trans$LoyaltyDate,\r\n                                         format = \"%m/%d/%Y\")\r\ncombined_trans$CreditCardDate <- date_parse(combined_trans$CreditCardDate,\r\n                                         format = \"%m/%d/%Y\")\r\ncombined_trans$LoyaltyNumber <- as_factor(combined_trans$LoyaltyNumber)\r\ncombined_trans$CardNumber<- as_factor(combined_trans$CardNumber)\r\ncombined_trans$LoyaltyNumber<- as_factor(combined_trans$LoyaltyNumber)\r\ncombined_trans$CreditCardTimestamp <- date_time_parse(combined_trans$CreditCardTimestamp,\r\n                                 zone = \"\",\r\n                                 format = \"%m/%d/%Y %H:%M\")\r\n\r\n\r\n\r\n#combined_trans_pivot$Date <- date_parse(combined_trans_pivot$Date,\r\n #                                        format = \"%m/%d/%Y\")\r\ncombined_trans_pivot$Date <- date_parse(combined_trans_pivot$Date,\r\n                                         format = \"%m/%d/%Y\")\r\ncombined_trans_pivot$CC.Loyalty <- as_factor(combined_trans_pivot$CC.Loyalty)\r\ncombined_trans_pivot$Location <- as_factor(combined_trans_pivot$Location)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-17T20:10:27+08:00",
    "input_file": "third-time-a-charm.knit.md"
  },
  {
    "path": "posts/2021-06-18-dataviz-2/",
    "title": "DataViz 2",
    "description": "Data Visualisation Assignment 2 - June 2021",
    "author": [
      {
        "name": "Manmit",
        "url": {}
      }
    ],
    "date": "2021-06-18",
    "categories": [],
    "contents": "\r\n1. Critique of Visualisation\r\n\r\nS/N\r\nClarity Critique\r\nSuggestion\r\ni.\r\nChart has no title - It is not clear what the reader should take away from the chart as there is no title to guide the reader through the story and the timeframe for the data.\r\nInsert a chart title to indicate what the chart is about. For example, “Total Trade with partners from year to year”.\r\nii.\r\nAxis labelling - The axis does not state the units (e.g S$). This is mis-leading when referencing the circles. For example, Taiwan shows S$75.2Bil, but it is not located anywhere near the 70 mark on both axes.\r\nLabel the axes with the units. In fact, the whole chart needs to be reworked to make it interactive. In this way the reader can interact with the chat to gather insights on the import and export trade values.\r\niii.\r\nDifferentiating by Net Importers/Exporters - While the idea is there, it is not clear at first look what it means for circles that are in both halves. In addition, the note below the chart requires effort to understand, making the chart use less visuals and more words for explanation. The small white circle in the centre is supposed to indicate if the partner is a net importer or exporter. This creates a confusion as the big circle is already within the net exporters/importers half of the chart.\r\nDivide the chart into quadrants instead. Break the quadrants up into High Export High Import etc.. This is useful for the reader to understand both the import and export of the partner in-relation to one another. High and low can be measured against the average. In addition, supplement a bubble plot with a bar chart to indicate the export/import values and the difference for users to understand net imports/exporters clearly. There is no requirement to pack everything into a single chart especially if it compromises clarity.\r\nS/N\r\nAesthetics Critique\r\nSuggestion\r\ni.\r\nOverlap of circles keeps you guessing what it really looks like - The circles overlap which is fine, but because of no opacity, the readers have to form an image of the full circle in their mind and figure out how it really compares. This is not aesthetically pleasing and unnecessary work for the reader.\r\nUse a degree of opacity to show the full circle.\r\nii.\r\nToo many colours - The chart does not look professional and it is a reflection of the author’s lack of clarity for what the chart is supposed to represent. Use colours to highlight the import aspects of the chart instead of colouring it everywhere. In addition, some colours look similar (EU and Thailand).\r\nWhen using the quadrant approach above (as stated in Clarity), use colours to indicate which quadrant the countries fall in to different them from one another.\r\niii.\r\nInformation flow, font size and use of circles - The information flow starts with details at the top (chart) before going broad to explain what it is about. It is not pleasing to read and refer to. The font used for the information below the chart is thin and small and hence challenging to read. In addition, some font is in caps (e.g TOP NET IMPORTER). This is aesthetically annoying. Lastly, author should be careful when using circles, as looking at big and small circles can distort the reader’s visual of how big/small the circles are.\r\nWhen sharing information, start with the broad picture above before going into details (the chart). Use a standard font across and avoid caps. Do not use big and small white circles together. Re-work the chart and divide it into two interactive charts as shown in the proposed design below.\r\n2. Proposed Design\r\n\r\n2.1 Advantages of Proposed Design\r\nStructured approach to story-telling: Each of the charts have a purpose and story to tell. The left chart shows how the partners match up against each other both in terms of total and individual (export/import) trade value. The chart on the right provides granularity on the figures. The story is easy to retain with the animation.\r\nInteractive Charts: The charts are interactive which gives the users the dexterity to perform their own analysis. For example, the user can filter by partner and date. In addition, the animation feature that was added provides a visualisation through time to understand the changes better.\r\nGranular details: The charts highlight the key parts that the reader should read. For example, the additional of quadrant and related colours indicate the importance of some trading partners. In addition, for the chart of the right, the tooltip provides details of the difference in trade for each partner’s export and import.\r\nAesthetically pleasing: The simple but purposeful charts invite the users to explore the charts and related data.\r\nLabels: The chart is well labelled and provides direction for the user. It leaves no room for ambiguity.\r\n3. Data Visualisation\r\nThe dashboard can be viewed here.\r\n\r\n4. Data Preparation step-by-step guide\r\nPrepare Data\r\nDownload Merchandise Trade by Region/Market from the Singapore Department of Statistics https://www.singstat.gov.sg/find-data/search-by-theme/trade-and-investment/merchandise-trade/latest-data .\r\nWithin the downloaded workbook, create duplicate T1 and T2 excel sheets and rename them “Imports Tableau” and “Exports Tableau”. These worksheets will be used to prepare the necessary data for the visualisation. \r\nSteps for both “Imports Tableau” and “Exports Tableau: As part of data preparation, remove data outside period January 2011 – December 2020. In addition, only keep data for the following 10 partners (Thailand, Indonesia, Hong Kong, Japan, Korea, Taiwan, US, China, Malaysia, and EU). Remove descriptive text.\r\nConvert European Union figures from Million Dollars to Thousand dollars. Multiply the values by 1000 and paste As Value in the row. \r\nData Cleaning Steps for both “Imports Tableau” and “Exports Tableau\r\nCheck fields for missing and null values. No missing or null values.\r\nChange headers from “Variables” to “Partners” \r\nChange values by multiplying all values by 1000 to get values in its raw form. It will be easier to deal with within Tableau.\r\nCopy Imports Table and transpose paste in new Worksheet. Create a column header called “Import/Export”. Label the rows as “Import. Re-name new Worksheet “Combine Import - Export”\r\nCopy Exports Table from “Exports Tableau” and transpose paste below Import table in “Combine Import - Export” worksheet. In Import/Export Column, name each the row as Export.\r\nRemove row with header “Partner” and partner names above 2011 Jan for Exports. \r\nData Prep in Tableau\r\nOpen Tableau and Import File into Tableau. \r\nDrag and drop “Combine Import – Export” sheet in Tableau sheet Data Source \r\nSelect the columns of the 10 partners (Thailand, Korea etc) and change the column format to Number (whole) by clicking on the # on the top left of the column header.Rename the column Partner to Date and change the format of column to Date. \r\nThe data needs to be pivoted to build the charts. To pivot the data, select all 10 partners columns, click on the down arrow at the top right beside the column name, select pivot. \r\nChange the pivot column names to “Trading Partner” and “Trade Value (S$)”. \r\nCheck that the columns are in the correct format. Date should be date format, Trading Partner and Import/Export should be a string and Trade Value should be Number (whole).\r\nOnce verified, go to Data>> Export Data to CSV \r\nWithin the exported CSV file, transform data to have the following columns: i) Date ii) Trading Partner iii) Import Trade Value and iv) Export Trade Value.\r\nThis will allow for quicker chart development. Save the file as an .xlsx (Excel) and not .CSV file. \r\nBuilding Charts\r\nImport excel file into new Tableau Book. Check all columns in the correct format as stated above.\r\nGo to worksheet.\r\nGo to Analysis > Create Calculated Field. Create a calculated field for Total Trade.\r\nTotal Trade = [Import Trade Value (S$)]+[Export Trade Value (S$)] \r\nCreate Bubble Plot by dragging Import Trade Value to x-axis and dragging Export Trade Value to y-axis\r\nThis will be the base graph. \r\nDrag and drop Total Trade Value to chart. Drag and drop partners to colour. Within the Marks, choose Circle.\r\n\r\n\r\nImproving the visual\r\nUnder Marks>Size, choose a big circle size\r\n b. Under Marks> Colour, choose blue as the circle border. c. Given some circles will overlap, under Marks> Colour, change the Opacity to 75%  d. Add a date filter\r\n• Drag and drop Date to Filter • Select All Dates • Once done, under Filter, select year, select discrete and select Show Filter  e. Add Country filter\r\n• Drag and drop Country to Filter • Under Filter, select show filter f. Under the Partner filter on the right panel, select Multiple Values Filter \r\nDiving deeper to improve story telling for visual\r\nDrag and drop Trading Partner to Label\r\nDrag and drop Total Trade Value to Label \r\nCreate Ranking for Import and Export and add to tooltip.\r\n• Go to Analysis > Create Calculated Field • Create Import Ranking with RANK_DENSE(SUM([Import Trade Value (S$)]),‘desc’) • Repeat and create for Export Ranking with RANK_DENSE(SUM([Export Trade Value (S$)]),‘desc’)  • Drag and drop Import Ranking and Export Ranking to Tooltip • Select each under Marks and change Compute Using > Partners  d. Add reference lines to show average for Imports and Exports • Go to Analytics and Add “Average Line” •Add to both Sum(Import Trade) and Sum(Export Trade) \r\nCreate quadrants • Visualise country by category quadrant “High Import, High Export”, “High Import, Low Export”, “Low Import, Low Export”, “Low Import, High Export” • Go to Analysis > Create Calculated Field> Create Quadrant\r\nIF SUM([Import Trade Value (S$)]) >= WINDOW_AVG(sum([Import Trade Value (S$)])) AND SUM([Export Trade Value (S$)]) >= WINDOW_AVG(sum([Export Trade Value (S$)])) THEN ‘High Import, High Export’\r\nELSEIF SUM([Import Trade Value (S$)]) <= WINDOW_AVG(sum([Import Trade Value (S$)])) AND SUM([Export Trade Value (S$)]) <= WINDOW_AVG(sum([Export Trade Value (S$)])) THEN ‘Low Import, Low Export’\r\nELSEIF SUM([Import Trade Value (S$)]) >= WINDOW_AVG(sum([Import Trade Value (S$)])) AND SUM([Export Trade Value (S$)]) <= WINDOW_AVG(sum([Export Trade Value (S$)])) THEN ‘High Import, Low Export’\r\nELSEIF SUM([Import Trade Value (S$)]) <= WINDOW_AVG(sum([Import Trade Value (S$)])) AND SUM([Export Trade Value (S$)]) >= WINDOW_AVG(sum([Export Trade Value (S$)])) THEN ‘Low Import, High Export’\r\nEND \r\n• Drag and drop Quadrant to colour, select Compute Using > Partners • Drag and drop Total Trade Value to size.\r\nTouch Up\r\nDrag and drop Total Trade Value to Label\r\nUnder Marks > Label > Change Label settings to Partner and Total Trade Value\r\nEdit Tooltip by clicking Tooltip. See the edits to the text in the image below. \r\nChange label settings as in the image below \r\nEdit filter titles. In the right panel with the filter, click the triangle and edit title. \r\nFormat > Add Animations to add animation to show the change of partner trade with time.\r\nSecond Visual – Bar Chart\r\nCreate Bar Chart to show specifics of each partners’ trade data\r\nSelect new worksheet tab within workbook.\r\nLabel as Bar Chart\r\nDrag and drop Partners to Y-axis\r\nDrag and drop Import Trade Value to x-axis\r\nDrag and drop Export Trade Value to x-axis \r\nRight click Export Trade Value and Import Trade Value header, de-select show header \r\nDrag and drop measure names to Colour\r\n i. Within colour filter on right panel, click edit colours to arrive at this panel. Change the colour to blue and select two different shades (one dark and one light)  j. Drag and drop Date to Filter, Select by Years, select all years k. Select show filter and apply to all using the data source  l. Analysis > Create Calculated Field > Trade difference between (Import - Export) ABS([Import Trade Value (S$)]-[Export Trade Value (S$)]) \r\nEdit Tooltip. Click tooltip and edit with the following: \r\nCreate Dashboard\r\nCreate dashboard sheet\r\nDrag and drop charts \r\nDrag and drop text box and insert Title, comments and source\r\nSelect text box and click layout out to format box colour\r\n\r\nTouch up charts to make dashboard look better\r\nChanged chart titles, labels, font size, colouring for each chart\r\nWithin dashboard, moved the legend around to improve aesthetics \r\nAdded comments below title\r\n5. Derived Insights\r\nMainland China’s total trade with Singapore has overtaken trade with Malaysia over the years. In 2011, Singapore’s total trade with Malaysia was $113B, ranking it 2 for imports and 1 for exports. By 2020, Malaysia was ranked 2 for imports and 4 for exports with a total trade at $103B. On the other hand, Mainland China was ranked at 4 for imports and exports in 2011 with a total trade of $102B. By 2020, it became Singapore’s largest trading partner ranked 1 for imports and exports with a total trade of $136B.\r\nSingapore’s imports and exports to Hong Kong has the largest trade deficit across all years. Hong Kong has also remained as Singapore’s low import but high export market. In 2011, Hong Kong ranked 10 for imports and 3 for exports. In 2020, it ranked 10 for imports and 2 for exports. The difference in trade amount in 2011 was $57B, in 2020 it was $59B.\r\nIn 2011, Singapore had 3 high import, high export partners. Namely, Malaysia, Mainland China and European Union. On the end of the spectrum, it had 3 low export, low import partners. By 2020, this dynamics had changed. Singapore had 4 high export, high import partners, namely, Mainland China, Malaysia, European Union and United States. In addition, it had 4 partners with low import, low export trade, namely, Japan, Korea, Indonesia and Thailand.\r\nOver the years, the animation highlights the growing total trade value between Singapore and the European Union and US, moving from a high import, low export relationship to a high import, high export relationship. While Indonesia has dropped from low import, high export to low import, low export.\r\nIn 2020, Singapore’s total trade with Mainland China at $136B is larger than its trade with Japan, Korea and Thailand combined at $128B.\r\nSingapore’s trade with Japan and Korea is approximately the same in 2020. Total trade with Korea and Japan is $45B and $50B respectively. The trade difference for Singapore and import and export to Korea and Japan is at $2B.\r\nI hope you enjoy exploring the data. Do hover over the bubbles and bar chart to derive deeper insights. The filters are also useful for analysis!\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-18T23:28:51+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-28-dataviz-1/",
    "title": "DataViz 1",
    "description": "Data Visualisation Assignment 1 - May 2021",
    "author": [
      {
        "name": "Manmit Singh, SMU Master of IT in Business student",
        "url": "https://www.linkedin.com/in/smitman/"
      }
    ],
    "date": "2021-05-28",
    "categories": [],
    "contents": "\r\n1. Critique of Visualisation\r\n\r\nS/N\r\nClarity Critique\r\nSuggestion\r\ni.\r\nChart title is not precise and contentious - “Merchandise Trade of Top Six Trading Countries, 2019 – 2020” does not indicate the country the trade data is in reference to. As such, the export and import numbers from each chart hold no value. In addition, it could be an issue to label Hong Kong and Taiwan as a country. Best to clarify and retitle the chart.\r\nClarify in the title that the trade data is in reference to Singapore’s top 6 trading partners.\r\nii.\r\nAxis labels are not aligned to graph title - The x-axis for the charts indicate a timescale between 2019 to 2021. However, the title for the visual indicates 2019 – 2020. This creates confusion when interpreting the timescale of the charts and challenging to compare various figures across the countries.\r\nStandardize the timeframe and clearly indicate the start and end time period in the chart title (e.g January 2020 – December 2021). Similar labelling by month/quarter should be labelled on the x-axis.\r\niii.\r\nAxis not labelled properly - The start and end month is not indicated on the x-axis. Tick marks are missing. In addition, the label “Month of Period” is confusing. It is challenging for the reader to accurately compare how each country performed over a particular period as the timeline may differ (e.g monthly, quarterly). Unclear what the Y-axis represents (USD, SGD, tonnes, number of shipments from port?).\r\nUse tick marks to indicate intervals on the x-axis. Re-label the x-axis to month or quarter, depending which unit is used. Y-axis should be labelled “Trade value in (S$)”.\r\niv.\r\nLegend is incomplete - The legend shows two colours, but the chart has three colours. The reader will be confused and left guessing what the third colour represents.\r\nDo not use a fill. Instead, a line chart would suffice.\r\nv.\r\nIncomplete information leading to ambiguity\r\nWhen viewed as a graph, the x-axis only provides 2020 data for Japan. 2020 is labelled at the centre of the axis. This misleads the reader that only 2020 data is shown in the graph. In addition, the source of the data is not given, and its credibility will be questioned.\r\nS/N\r\nAesthetics Critique\r\nSuggestion\r\ni.\r\nOverlap of colours hides data - The reader only gets a partial picture of the data as the colour and its opacity chosen hides many data points. Reflecting on this, the charts are not useful to the reader and does not tell a story.\r\nDo not use a chart with a colour fill. Instead use a line chart for the user to derive data points and understand the values and the story of how the imports and exports changed over time.\r\nii.\r\nChoice of chart -The reader needs to study each graph before comparing the figures across to understand the story. It is not reader friendly and time consuming. It would be easier if the visual was more forthcoming with the story and highlighted what the reader should take away.\r\nThe intent of the charts are unclear and hence the story is not clear. Instead of showing each trading partner’s export and import data in one chart, it may be more useful to flesh all export data in one chart and all import in another chart. Also, key global events could be indicated to flesh out how the trade has changed and the trends. The take-away from this will be clearer.\r\niii.\r\nFont Size and Axis- The font is small, and the dull colour choice makes it difficult to read. In addition, the x and y axis are indicated with a negative scale, even though the numbers are all within the positive scale.\r\nChange the colours to visually draw the reader to chart and use bigger font for easy readability. Also, do away with the negative axis.\r\n2. Proposed Design\r\n\r\n2.1 Advantages of Proposed Design\r\nClear title and commentary - The chart has a focus and highlights how trade between its largest trading partners changed after a global event.\r\nClear grouping of data for easy cross referencing – Exports and imports are in separate chart. Reader is able to clearly compare the difference between the partners and the change over time\r\nAble to interpret the data in industry language – The timeline used is quarterly and the trade value is indicated in Singapore Dollar. These are common values used to understand trade better (usually quarterly data is analysed for performance and not monthly).\r\nAesthetically invites the reader to explore the chart - Colours are consistent throughout the dashboard and highlight the important aspects the reader should take note of.\r\nRelatable story and addresses concerns - Trade data is relatable to a recent global event and the change in percentage is highlighted. Reader does not need to calculate this. Furthermore, quarterly performance is easily attainable by referencing the line chart if further details are required.\r\n3. Data Preparation step-by-step guide\r\nS/N\r\nAction\r\nStep\r\n1.\r\nCreated excel worksheets “Imports Tableau” and “Exports Tableau” for Imports and Exports to work on for data cleaning. Not recommended to overwrite original data.\r\n\r\n2.\r\nData Cleaning to remove unnecessary information. First, removed imports and exports data from 1976 – 2018 (inclusive). Then removed row data outside top 6 trading partners (Mainland China, Japan, Hong Kong, Malaysia, Taiwan, United States). Lastly, removed data descriptive text.\r\n-\r\n3.\r\nData Cleaning to check data and headings. For import and export data, checked for null values and standardized units to dollars. Specifically, convert all trade values to actual and removed “million dollars” and “thousand dollars” unit. Changed headings of columns and rows.\r\n\r\n4.\r\nTranspose table and combine Export and Import Data into a single table and create a column Export/Import.\r\n\r\n5.\r\nImport the file to Tableau. Checked data is in the correct format type: Date is in date format; Country trade value data is Numerical <Number (Whole)>; Import and Export Column is a string.\r\n-\r\n6.\r\nPivot the data. Reference: https://help.tableau.com/current/pro/desktop/en-us/pivot.htm. Pivot the data then checked data type correct and rename “Pivot Field Names” to “Country” and “Trade Value”. Change “Country” to string and “Trade Value” to number (whole).\r\n\r\n7.\r\nExport data and save file as csv Reference: https://help.tableau.com/current/pro/desktop/en-us/save_export_data.html\r\n\r\n8.\r\nImport the cleaned dataset into Tableau. Ensure format is correct and data in order (no missing columns, null values)\r\n-\r\n9.\r\nWork on Import Dataset first. Go to new worksheet and re-name worksheet as Import. Then drag Country to colour. Ensure data is continuous for Year and Trade Value. Next, create a line chart with Year, Trade Value and Country. Filter the Import/Export data by Import.\r\n\r\n10.\r\nImprove the chart by adding titles, clarifying the axis, adding reference marks, and describing the data. Add Chart Title. Then edit X and Y axis to i) appropriately title axis and ii) highlight tick marks. Thereafter, adding reference lines for when a large portion of the world was in lockdown. Given Singapore is an global trading hub and depends on free trade for its economy, it is an important timeline to flesh out and story to tell. Reference for global lockdowns: https://www.bbc.com/news/world-52103747. To be more specific with data, add reference bands. Add Label to identify reference band “Trade Post Covid Global Lockdown Peak”\r\n\r\n11.\r\nAdd percentage change between Peak covid lockdowns Q1 2020 – Q4 2020. Drag Sum Value to Detail under Marks. Select Quick Table Calculation > Percentage Difference. Select Edit Table Calculation. % change difference from Q4 2020 to Q1 2020 Drag and drop Trade values to Label.\r\n\r\n12.\r\nRepeat steps 9 to 11 for Exports\r\n-\r\n13.\r\nCreate a dashboard. Add sheets Import and Export. Thereafter, add text object for the Title, Commentary below title and Source below the charts. Move legend below charts and Source below legend. Complete the Title, Commentary and Source commentary. Edit the text boxes for the above using the layout option on the left. Lastly, ensure entire colour scheme does not clash and modify colours and sizing for aesthetics.\r\n-\r\n4. Dashboard\r\nThe dashboard can be viewed here\r\n\r\n5. Derived Insights for merchandise trade between Singapore and its top 6 trading partners between 2019 and 2020 (inclusive)\r\nOverall, Covid-19 had little impact on Singapore’s trade with majority performance being stronger compared to Q1 2019.\r\nImports into Singapore in Q4 2020 compared to Q1 2019 were higher for Mainland China, Taiwan, Hong Kong and Malaysia. Imports from Japan and US decreased.\r\nExports to Mainland China, Hong Kong, Taiwan, Malaysia and Japan increased in Q4 2020 compared to Q1 2019. Exports to Malaysia decreased.\r\nChina is Singapore’s largest trading partner for imports and exports for merchandise at $18.5B and $20.9B respectively.\r\nPost Covid-19 Global Lockdowns, only trade with US decreased across exports and imports.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-16T00:29:03+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Visual Blog - R for Data Science and Analytics",
    "description": "Welcome to my Visual blog, VizBlog. I hope you enjoy \nbrowsing the projects!",
    "author": [
      {
        "name": "Manmit Singh, SMU Master of IT in Business student",
        "url": "https://www.linkedin.com/in/smitman/"
      }
    ],
    "date": "2021-05-23",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-28T15:24:55+08:00",
    "input_file": {}
  }
]
